# Задача 1

# За день машина проезжает n километров.
# Сколько дней нужно, чтобы проехать маршрут
# длиной m километров? При решении этой задачи
# нельзя пользоваться условной инструкцией if и циклами.

# n = int(input("Сколько машина проезжает за день, км: "))
# m = int(input("Введите растояние маршрута, км: "))
# print(-(-m//n))

# Задача 2

# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты
# для них новыми партами. За каждой партой может
# сидеть два учащихся. Известно количество учащихся
# в каждом из трех классов. Выведите наименьшее число
# парт, которое нужно приобрести для них.

# print("Количество учеников в первом классе: ")
# a = int(input())
# print("Количество учеников во втором классе: ")
# b = int(input())
# print("Количество учеников в третьем классе: ")
# c = int(input())
# print(-((-(a + b + c))//2))
# # или более верное решение
# a1 = (-a) // 2
# b1 = (-b) // 2
# c1 = (-c) // 2
# print(-(a1 + b1 +c1))

# Задача 3

# Вагоны в электричке пронумерованы натуральными числами,
# начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда,
# а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка).
# В каждом вагоне написан его номер. Витя сел в i-й вагон
# от головы поезда и обнаружил, что его вагон имеет номер j.
# Он хочет определить, сколько всего вагонов в электричке.
# Напишите программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать невозможно.

# i = int(input("You got on the train car number: "))
# j = int(input("In fact: "))

# if i == j:
#     answer = "I don't know"
# else:
#     answer = i + j - 1
# print(answer)


# Задача 4

# Дано натуральное число. Требуется определить, является ли
# год с данным номером високосным. Если год является високосным,
# то выведите YES, иначе выведите NO. Напомним, что в соответствии
# с григорианским календарем, год является високосным,
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.

# a = int(input("Введите год: "))
# if a % 4 == 0 or a % 400 == 0:
#     print("YES")
# elif a % 100 == 0:
#     print("NO")
# else:
#     print("NO")

#  или

a = int(input("Какой год? \n"))
if (a % 4 == 0 and a % 100) or a % 400 == 0:
    print("yes")
else:
    print("no")
